ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/serial_api.c
    /* All events should have generated a return, if no return has happened, no event has been caught */
    return 0;
}

/** Unified IRQ handler. Determines the appropriate handler to execute and returns the flags.
 *
 * WARNING: this code should be stateless, as re-entrancy is very possible in interrupt-based mode.
 */
int serial_irq_handler_asynch(serial_t *obj)
{
    uint32_t txc_int;

    if(LEUART_REF_VALID(obj->serial.periph.leuart)) {
        txc_int = LEUART_IntGetEnabled(obj->serial.periph.leuart) & LEUART_IF_TXC;
    } else {
        txc_int = USART_IntGetEnabled(obj->serial.periph.uart) & USART_IF_TXC;
    }

    /* First, check if we're running in DMA mode */
    if( (obj->serial.dmaOptionsRX.dmaChannel != -1) &&
        serial_dma_irq_fired[obj->serial.dmaOptionsRX.dmaChannel]) {
        /* Clean up */
        serial_dma_irq_fired[obj->serial.dmaOptionsRX.dmaChannel] = false;
        serial_rx_abort_asynch_intern(obj, 1);

        /* Notify CPP land of RX completion */
        return SERIAL_EVENT_RX_COMPLETE & obj->serial.events;
    } else if (txc_int && (obj->serial.dmaOptionsTX.dmaChannel != -1) &&
               serial_dma_irq_fired[obj->serial.dmaOptionsTX.dmaChannel]) {
        if(LEUART_REF_VALID(obj->serial.periph.leuart)) {
            /* Clean up */
            serial_dma_irq_fired[obj->serial.dmaOptionsTX.dmaChannel] = false;
            serial_tx_abort_asynch_intern(obj, 1);
            /* Notify CPP land of completion */
            return SERIAL_EVENT_TX_COMPLETE & obj->serial.events;
        }else{
            /* Clean up */
            serial_dma_irq_fired[obj->serial.dmaOptionsTX.dmaChannel] = false;
            serial_tx_abort_asynch_intern(obj, 1);
            /* Notify CPP land of completion */
            return SERIAL_EVENT_TX_COMPLETE & obj->serial.events;
        }
    } else {
        /* Check the NVIC to see which interrupt we're running from
         * Also make sure to prioritize RX */
        if(LEUART_REF_VALID(obj->serial.periph.leuart)) {
            //Different method of checking tx vs rx for LEUART
            if(LEUART_IntGetEnabled(obj->serial.periph.leuart) & (LEUART_IF_RXDATAV | LEUART_IF_FERR | LEUART_IF_PERR | LEUART_IF_RXOF)) {
                return serial_rx_irq_handler_asynch(obj);
            } else if(LEUART_StatusGet(obj->serial.periph.leuart) & (LEUART_STATUS_TXBL | LEUART_STATUS_TXC)) {
                return serial_tx_irq_handler_asynch(obj);
            }
        } else {
            if(USART_IntGetEnabled(obj->serial.periph.uart) & (USART_IF_RXDATAV | USART_IF_RXOF | USART_IF_PERR | USART_IF_FERR)) {
                return serial_rx_irq_handler_asynch(obj);
            } else if(USART_StatusGet(obj->serial.periph.uart) & (USART_STATUS_TXBL | USART_STATUS_TXC)){
                return serial_tx_irq_handler_asynch(obj);
            }
        }
    }

    // All should be done now
    return 0;
}

/** Abort the ongoing TX transaction. It disables the enabled interupt for TX and
 *  flush TX hardware buffer if TX FIFO is used
 *
 * @param obj The serial object
 */
void serial_tx_abort_asynch(serial_t *obj)
{
    serial_tx_abort_asynch_intern(obj, 0);
}

static void serial_tx_abort_asynch_intern(serial_t *obj, int unblock_sleep)
{
    // Transmitter should be disabled here but there are multiple issues
    // making that quite difficult.
    //
    // - Disabling the transmitter when using DMA on platforms prior to
    //   Pearl can cause the UART to leave the line low, generating a break
    //   condition until the next transmission begins.
    //
    // - On (at least) Pearl, once TXC interrupt has fired it will take some time
    //   (some tens of microsec) for TXC to be set in STATUS. If we turn off
    //   the transmitter before this, bad things will happen.
    //
    // - On (at least) Pearl, when using TX DMA it is possible for the USART
    //   status to be: TXENS TXBL TXIDLE = 1, TXBUFCNT = 0, but TXC = 0.
    //
    // All in all, the logic was so fragile it's best to leave it out.

    /* Clean up */
    switch(obj->serial.dmaOptionsTX.dmaUsageState) {
        case DMA_USAGE_ALLOCATED:
            /* stop DMA transfer */
#ifndef LDMA_PRESENT
            DMA_ChannelEnable(obj->serial.dmaOptionsTX.dmaChannel, false);
#else
            LDMA_StopTransfer(obj->serial.dmaOptionsTX.dmaChannel);
#endif
            break;
        case DMA_USAGE_TEMPORARY_ALLOCATED:
            /* stop DMA transfer and release channel */
#ifndef LDMA_PRESENT
            DMA_ChannelEnable(obj->serial.dmaOptionsTX.dmaChannel, false);
#else
            LDMA_StopTransfer(obj->serial.dmaOptionsTX.dmaChannel);
#endif
            dma_channel_free(obj->serial.dmaOptionsTX.dmaChannel);
            obj->serial.dmaOptionsTX.dmaChannel = -1;
            obj->serial.dmaOptionsTX.dmaUsageState = DMA_USAGE_OPPORTUNISTIC;
            break;
        default:
            break;
    }

    /* stop interrupting */
    if(LEUART_REF_VALID(obj->serial.periph.leuart)) {
        LEUART_IntDisable(obj->serial.periph.leuart, LEUART_IEN_TXBL);
        LEUART_IntDisable(obj->serial.periph.leuart, LEUART_IEN_TXC);
        LEUART_IntClear(obj->serial.periph.leuart, LEUART_IFC_TXC);
    } else {
        USART_IntDisable(obj->serial.periph.uart, USART_IEN_TXBL);
        USART_IntDisable(obj->serial.periph.uart, USART_IEN_TXC);
        USART_IntClear(obj->serial.periph.uart, USART_IFC_TXC);
    }

    /* Say that we can stop using this emode */
    if(unblock_sleep)
        serial_unblock_sleep(obj);
}


static void serial_unblock_sleep(serial_t *obj)
{
    if( obj->serial.sleep_blocked > 0 ) {
#ifdef LEUART_USING_LFXO
        if(!LEUART_REF_VALID(obj->serial.periph.leuart) || (LEUART_BaudrateGet(obj->serial.periph.leuart) > (LEUART_LF_REF_FREQ/2))){
            sleep_manager_unlock_deep_sleep();
        }
#else
        sleep_manager_unlock_deep_sleep();
#endif
        obj->serial.sleep_blocked--;
    }
}

static void serial_block_sleep(serial_t *obj)
{
    obj->serial.sleep_blocked++;
#ifdef LEUART_USING_LFXO
    if(!LEUART_REF_VALID(obj->serial.periph.leuart) || (LEUART_BaudrateGet(obj->serial.periph.leuart) > (LEUART_LF_REF_FREQ/2))){
        /* LEUART configured to a baudrate triggering the use of HFCLK, so prevent HFCLK from getting turned off */
        sleep_manager_lock_deep_sleep();
    }
#else
    /* HFCLK unavailable in deepsleep */
    sleep_manager_lock_deep_sleep();
#endif
}

/** Abort the ongoing RX transaction It disables the enabled interrupt for RX and
 *  flush RX hardware buffer if RX FIFO is used
 *
 * @param obj The serial object
 */
void serial_rx_abort_asynch(serial_t *obj)
{
    serial_rx_abort_asynch_intern(obj, 0);
}

static void serial_rx_abort_asynch_intern(serial_t *obj, int unblock_sleep)
{
    /* Stop receiver */
    if(LEUART_REF_VALID(obj->serial.periph.leuart)) {
        obj->serial.periph.leuart->CMD = LEUART_CMD_RXDIS;
        while(obj->serial.periph.leuart->SYNCBUSY & LEUART_SYNCBUSY_CMD);
    } else {
        obj->serial.periph.uart->CMD = USART_CMD_RXDIS;
    }

